In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.11/site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd
print(pd.__version__)

2.1.4

# `series`

- it is like a column in a table
- it is a one-dimensional array holding data of any type

In [3]:
a = [23,34,23]
x = pd.Series(a)
print(x)
print(x[0])
print(x[2])

0    23
1    34
2    23
dtype: int64
23
23

In [4]:
nums = [56,66,77]
marks = pd.Series(nums, index = ["rohan","tushar","yogesh"])
print(marks)

rohan     56
tushar    66
yogesh    77
dtype: int64

In [5]:
students = {
    "class_10 " : 34,
    "class_11" : 23,
    "class_12" : 12
}

In [6]:
data = pd.Series(students)
print(data)

class_10     34
class_11     23
class_12     12
dtype: int64

In [7]:
data = {
    "calories_burnt" : [234,453,233],
    "duration" : [34,23,45]
}

In [8]:
mydata = pd.DataFrame(data)
print(mydata)

   calories_burnt  duration
0             234        34
1             453        23
2             233        45

In [16]:
print(mydata.loc[1])

calories_burnt    453
duration           23
Name: 1, dtype: int64

In [18]:
print(mydata.loc[[0,2]])

   calories_burnt  duration
0             234        34
2             233        45

In [20]:
print(mydata.loc[0:2])

   calories_burnt  duration
0             234        34
1             453        23
2             233        45

In [89]:
df = pd.read_csv("./sample_data.csv")
print(df)

          name   age              department  salary          date  \
0     John Doe  28.0                      HR   50000    2023-01-15
1   Jane Smith   NaN                      IT   60000    2023-02-10
2    Bob Jones  45.0                      hr   75000    2023-03-20
3  Alice Brown  32.0  Information Technology   55000    2023-04-05
4     John Doe  28.0                      HR   50000    2023-01-15
5   Tom Wilson  50.0                 Finance  120000    2023-05-12
6     Sara Lee  29.0                     NaN   65000    2023-06-18
7    Mike Chen  35.0                      IT   80000  invalid_date
8   Emma Davis  60.0                 Finance  200000    2023-07-22
9     Lisa Ray  27.0                     HR    52000    2023-08-10

                   email
0     john.doe@email.com
1   jane.smith@email.com
2     bob.jones@email.com
3  alice.brown@email.com
4     john.doe@email.com
5   tom.wilson@email.com
6     sara.lee@email.com
7    mike.chen@email.com
8   emma.davis@email.com
9      lisa.ray@email.com

In [27]:
df_excel = pd.read_excel("./file_example_XLSX_10.xlsx")

In [29]:
print(df_excel)

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

In [33]:
print(df_excel.isnull())

       0  First Name  Last Name  Gender  Country    Age   Date     Id
0  False       False      False   False    False  False  False  False
1  False       False      False   False    False  False  False  False
2  False       False      False   False    False  False  False  False
3  False       False      False   False    False  False  False  False
4  False       False      False   False    False  False  False  False
5  False       False      False   False    False  False  False  False
6  False       False      False   False    False  False  False  False
7  False       False      False   False    False  False  False  False
8  False       False      False   False    False  False  False  False

In [37]:
print(df.isnull())

    name    age  department  salary   date  email
0  False  False       False   False  False   False
1  False   True       False   False  False   False
2  False  False       False   False  False   False
3  False  False       False   False  False   False
4  False  False       False   False  False   False
5  False  False       False   False  False   False
6  False  False        True   False  False   False
7  False  False       False   False  False   False
8  False  False       False   False  False   False
9  False  False       False   False  False   False

In [55]:
df

,name,age,department,salary,date,email
0,John Doe,28.0,HR,50000,2023-01-15,john.doe@email.com
1,Jane Smith,NaN,IT,60000,2023-02-10,jane.smith@email.com
2,Bob Jones,45.0,hr,75000,2023-03-20,bob.jones@email.com
3,Alice Brown,32.0,Information Technology,55000,2023-04-05,alice.brown@email.com
4,John Doe,28.0,HR,50000,2023-01-15,john.doe@email.com
5,Tom Wilson,50.0,Finance,120000,2023-05-12,tom.wilson@email.com
6,Sara Lee,29.0,NaN,65000,2023-06-18,sara.lee@email.com
7,Mike Chen,35.0,IT,80000,invalid_date,mike.chen@email.com
8,Emma Davis,60.0,Finance,200000,2023-07-22,emma.davis@email.com
9,Lisa Ray,27.0,HR,52000,2023-08-10,lisa.ray@email.com

In [91]:
df = df.dropna(subset="age")

In [99]:
df = df.fillna({"department" : "HR"})
print(df)

          name   age              department  salary          date  \
0     John Doe  28.0                      HR   50000    2023-01-15
2    Bob Jones  45.0                      hr   75000    2023-03-20
3  Alice Brown  32.0  Information Technology   55000    2023-04-05
4     John Doe  28.0                      HR   50000    2023-01-15
5   Tom Wilson  50.0                 Finance  120000    2023-05-12
6     Sara Lee  29.0                      HR   65000    2023-06-18
7    Mike Chen  35.0                      IT   80000  invalid_date
8   Emma Davis  60.0                 Finance  200000    2023-07-22
9     Lisa Ray  27.0                     HR    52000    2023-08-10

                   email
0     john.doe@email.com
2     bob.jones@email.com
3  alice.brown@email.com
4     john.doe@email.com
5   tom.wilson@email.com
6     sara.lee@email.com
7    mike.chen@email.com
8   emma.davis@email.com
9      lisa.ray@email.com

In [103]:
print(df.dtypes)

name           object
age           float64
department     object
salary          int64
date           object
email          object
dtype: object

In [107]:
df["age"] = df["age"].astype(int)

In [109]:
df

,name,age,department,salary,date,email
0,John Doe,28,HR,50000,2023-01-15,john.doe@email.com
2,Bob Jones,45,hr,75000,2023-03-20,bob.jones@email.com
3,Alice Brown,32,Information Technology,55000,2023-04-05,alice.brown@email.com
4,John Doe,28,HR,50000,2023-01-15,john.doe@email.com
5,Tom Wilson,50,Finance,120000,2023-05-12,tom.wilson@email.com
6,Sara Lee,29,HR,65000,2023-06-18,sara.lee@email.com
7,Mike Chen,35,IT,80000,invalid_date,mike.chen@email.com
8,Emma Davis,60,Finance,200000,2023-07-22,emma.davis@email.com
9,Lisa Ray,27,HR,52000,2023-08-10,lisa.ray@email.com

In [111]:
duplicates = df.duplicated()
print(duplicates)

0    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [113]:
df_no_duplicates = df.drop_duplicates()
print(df_no_duplicates)

          name  age              department  salary          date  \
0     John Doe   28                      HR   50000    2023-01-15
2    Bob Jones   45                      hr   75000    2023-03-20
3  Alice Brown   32  Information Technology   55000    2023-04-05
5   Tom Wilson   50                 Finance  120000    2023-05-12
6     Sara Lee   29                      HR   65000    2023-06-18
7    Mike Chen   35                      IT   80000  invalid_date
8   Emma Davis   60                 Finance  200000    2023-07-22
9     Lisa Ray   27                     HR    52000    2023-08-10

                   email
0     john.doe@email.com
2     bob.jones@email.com
3  alice.brown@email.com
5   tom.wilson@email.com
6     sara.lee@email.com
7    mike.chen@email.com
8   emma.davis@email.com
9      lisa.ray@email.com

In [119]:
df_2 = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 30, 35],
    'salary': [50000, 60000, None, 80000]
})

In [125]:
sum_stats = df_2[["age" ,"salary"]].sum()
print(sum_stats)

age          120.0
salary    190000.0
dtype: float64

In [129]:
mean_stats = df_2[["age" , "salary"]].mean()
print(mean_stats)

age          30.000000
salary    63333.333333
dtype: float64

In [131]:
median_stats = df_2[["age" , "salary"]].median()
print(median_stats)

age          30.0
salary    60000.0
dtype: float64

In [133]:
mode_stats = df_2[["age" , "salary"]].mode()
print(mode_stats)

    age   salary
0  30.0  50000.0
1   NaN  60000.0
2   NaN  80000.0

In [135]:
mode_stats = df_2[["age" , "salary"]].mode()

Object `mode` not found.

In [137]:
df_2.describe()

             age        salary
count   4.000000      3.000000
mean   30.000000  63333.333333
std     4.082483  15275.252317
min    25.000000  50000.000000
25%    28.750000  55000.000000
50%    30.000000  60000.000000
75%    31.250000  70000.000000
max    35.000000  80000.000000